@extends('layouts.app')
@section('content')
    <section class="section__title">
        <h2>
            О нас </h2>
    </section>
    <main class="howToBuy">
        <section class="section__title">&nbsp;</section>

        <div class="list--agreement">
            <h3>Кто мы?</h3>
            <p>Привет! Мы - book24.ru, интернет-магазин издательской группы Эксмо-АСТ. Наш магазин появился в 2023 году и с
                тех пор продал столько же книг.
            </p>
            <p>
                На наших полках книги всех значимых издательств: кроме «Эксмо» и «АСТ» это «Манн, Иванов и Фербер»,
                «Азбука», «Альпина», «Синдбад» и другие.
            </p>
            <p>
                А среди издательских брендов, которые представлены в BookSell.ru есть: «БОМБОРА», «Corpus», «Mainstream»,
                «Редакция Елены Шубиной», «Вилли-Винки», «Fanzon», «Комильфо» и «Канц-Эксмо». И мы постоянно пополняем эти
                списки.
            </p>


            <h3>Что мы делаем?</h3>
            <p>Мы не просто продаём электронные книги. BookSell.ru - часть издательства, а это значит, что мы гораздо ближе
                к
                процессу появления книг в ваших устройствах.
            </p>
                Эта близость позволяет нам быть экспертами. Мы заранее знаем, когда выходят новинки и получаем их первыми.

        </div>
    </main>
@endsection('content')
