@extends('layouts.app')
@section('content')
    <section class="section__title">
        <h2>
            Соглашение </h2>
    </section>
    <main class="howToBuy">
        <section class="section__title">&nbsp;</section>

        <div class="list--agreement">

            <ul>
                
                <li>Общие положения</li>
                <p>Сторонами настоящего соглашения являются BookSell.ru и Пользователь, далее совместно именуемые «Стороны».</p>
                <p> Отношения Пользователя - физического лица и BookSell.ru регулируются настоящим Соглашением, Гражданским Кодексом РФ (далее – «ГК РФ»), Законом РФ «О защите прав потребителей» от 07.02.1992 № 2300-1 (далее – «Закон РФ «О защите прав потребителей»), Правилами продажи товаров по договору розничной купли-продажи, утвержденными Постановлением Правительства РФ 31 декабря 2020 г. N 2463, Федеральным законом № 152-ФЗ «О персональных данных» (далее – ФЗ «О персональных данных) и иными федеральными законами и подзаконными нормативными актами.</p>
                <p> Отношения Пользователя-юридического лица и BookSell.ru регулируются настоящим Соглашением, ГК РФ и договором купли-продажи, заключаемым Сторонами в порядке, предусмотренном разделом 12 настоящего Соглашения.</p>
                <p>Условия настоящего Соглашения регулируют порядок пользования всеми Сервисами Сайта, существующими на момент регистрации Пользователя, а также Сервисами, которые будут созданы в будущем или модифицированы (изменены). Неотъемлемыми частями настоящего соглашения является информация, размещенная BookSell.ru в разделах, прямо указанных в настоящем Соглашении.</p>
                <p>Настоящее Соглашение вступает в силу с момента выражения Пользователем своего согласия с его условиями путем нажатия кнопки «Зарегистрироваться» (акцепта). До осуществления процедуры регистрации Пользователь обязан внимательно ознакомиться со всеми положениями настоящего Соглашения.</p>
                <li>Регистрация на Сайте</li>
                <p>В целях приобретения Товара из каталога Интернет-магазина, и иных целях, Пользователь добровольно проходит процедуру регистрации на Сайте и предоставляет достоверную и полную информацию по вопросам, предлагаемым BookSell.ru при Регистрации. Указанная Пользователем информация (персональные данные) необходима для выполнения обязательств со стороны BookSell.ru по договору розничной купли-продажи Товара дистанционным способом в отношении приобретаемого Пользователем Товара.</p>
                <p>Пользователь несет ответственность за достоверность и актуальность предоставленной при Регистрации информации.</p>
                <p> После прохождения всех этапов регистрации на Сайте, Пользователь имеет право использовать указанный им номер телефона для идентификации на Сайте и доступа к сервисам Сайта, а также для совершения покупок Товара из каталога на Сайте Продавца. Пользователь несет ответственность за все совершаемые на Сайте действия с использованием своего кода доступа и обязуется не передавать свои идентификационные данные, в том числе персональные, третьим лицам. Ответственность за сохранность полученного кода доступа лежит на Пользователе.</p>
                <p>Пользователь обязуется осуществлять безопасное завершение работы под своим паролем (кнопка «Выход») по окончании каждой сессии работы с сервисами Сайта.</p>
                <p>Пользователь согласен с тем, что BookSell.ru имеет право заблокировать и/или удалить учетную запись, либо прекратить действие учетной записи в отношении любых сервисов Сайта при нарушении Пользователем условий настоящего Соглашения.</p>
                <p>Пользователь вправе в любой момент потребовать от BookSell.ru удаления и/или блокировки своей учетной записи на Сайте путем направления соответствующего требования на адрес электронной почты BookSell.ru: imarket@BookSell.ru.</p>
                <p>Пользователь согласен с тем, что BookSell.ru имеет право слать информационную рассылку на электронный адрес, указанный при регистрации, а также SMS сообщения на телефон, указанный при регистрации. Пользователь проинформирован о том, что в случае, если у него возникнет желание отказаться от информационной рассылки Сайта, ему будет необходимо самостоятельно перейти по ссылке «Отписаться от рассылки», указываемой в тексте отправляемых сообщений от имени BookSell.ru с электронного адреса imarket@BookSell.ru, либо путем направления соответствующего требования на адрес электронной почты BookSell.ru: imarket@BookSell.ru.</p>

            </ul>



            </ol>
        </div>
    </main>
@endsection('content')
